erinmi4/SmartAgriculture/USER/stm32f407project/src/main_light_test.c
/**
 * @file    main_light_test.c
 * @brief   光敏电阻测试程序
 * @details 专门用于测试光敏电阻功能的简化版本
 */

#include "stm32f4xx.h"
#include "sys.h"
#include "delay.h"
#include "lcd.h"
#include "light.h"
#include <stdio.h>

int main(void)
{
    uint16_t light_value = 0;
    LightLevel_t light_level = LIGHT_LEVEL_NORMAL;
    
    // 系统初始化
    SystemInit();
    NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);
    
    // 初始化LCD1602
    lcd_init();
    
    // 测试LCD显示
    lcd_clear();
    lcd_print_str(0, 0, "Light Test");
    lcd_print_str(1, 0, "Initializing...");
    Mdelay_Lib(2000);
    
    // 初始化光敏电阻
    lcd_clear();
    lcd_print_str(0, 0, "Init Light...");
    Light_Init();
    Mdelay_Lib(1000);
    
    // 显示启动信息
    lcd_clear();
    lcd_print_str(0, 0, "Light Sensor");
    lcd_print_str(1, 0, "Ready!");
    Mdelay_Lib(2000);
    
    while(1)
    {
        // 获取光照数据
        light_value = Light_GetRawValue();
        light_level = Light_GetLevel();
        
        // 在LCD上显示光照数据
        char str[32] = {0};
        
        // 第一行显示原始ADC值
        sprintf(str, "ADC: %4d", light_value);
        lcd_print_str(0, 0, str);
        
        // 第二行显示光照等级
        sprintf(str, "Level: %s", Light_GetLevelString(light_level));
        lcd_print_str(1, 0, str);
        
        Mdelay_Lib(500); // 0.5秒更新一次
    }
}
